print ( '''
           ______________________
          |                     |
          | Калькулятор v1.1    |
          | ____________________|
 поддержка знаков (*,+,-,**)  и расчёт площади и периметра ''' )   
what  =  input ( 'что нужно геометрия или арифметика ? ')
if what ==  "арифметика" :
     what  =  input ( "Знак действия (*,:,+,-,**)" )
     if what == '*' or ':' or '+' or '-' or '**':
          if what ==  "+" :
               a  =  float ( input ( "Первое слогаемое " ))
               b  =  float ( input ( "Второе слогаемое " )) 
               с  =  a  +  b
               print ( "Результат :"+  str ( c ))
          elif what ==  "-" :
               a  =  float ( input ( "Первое число ==>:" ))
               b  =  float ( input ( "Второе число ==>:" )) 
               с  =  a  -  b
               print ( " Результат:"  +  str ( c ))
          elif what  ==  "*" :
               a  =  float ( input ( "Первый множитель ==>:" ))
               b  =  float ( input ( "Второй множитель ==>:" )) 
               с  = a  * b
               print ( "Результат :"  +  str ( c ))
          elif what  ==  ":" :
               a  =  float ( input ( "Первое число " ))
               b  =  float ( input ( "Второе число " )) 
               с  =  a  / b
               print ( "Результат :"  +  str ( c ))
          elif what  ==  "**" :
               a  =  float ( input ( "Первое число " ))
               b  =  float ( input ( "Второе число " )) 
               с  =  a  **  b
               print ( "Результат :"  +  str ( c ))
     else:
          print ( "Неверная операция !! можно только +, -, *, / !!" )
if what == 'геометрия':
     what  =  input ( 'какая фигура (прямоугольник, квадрад, окружность')
     if what ==  "прямоугольник" :
          a  =  float ( input ( "Первая сторона" ))
          b  =  float ( input ( "Вторая сторона" )) 
          с  =  a  +  b
          s=a*b
          print ( "Результат периметр  :", c,'см плошадь:',s," см2")
     elif what ==  "квадрад" :
          a  =  float ( input ( " сторона" ))
          b  = a 
          с  =  a  +  b
          s=a*b
          print (  "Результат периметр  :", c,'см плошадь:',s," см2")
          
     elif what  ==  "окружность" :
          a  =  float ( input ( "радиус" ))
          s  =  a**2*3.14
          с  =  a*2*3.14
          print ( "Результат периметр  :", c,'см плошадь:',s," см2")
     