y=input('language?')
if y =="Русский"or "русский" or"руский"  or 'Russian ':
     print ( '''
                ______________________
               |                     |
               | Калькулятор v1.03   |
               | ____________________|
      поддержка знаков (*,+,-,**)  и расчёт площади , периметра ''' )   
     what  =  input ( 'что нужно геометрия , арифметика, скорость  ? ')
     if what ==  "арифметика" :
          what  =  input ( "Знак действия (*,:,+,-,**)" )
          if what == '*' or ':' or '+' or '-' or '**':
               if what ==  "+" :
                    a  =  float ( input ( "Первое слогаемое " ))
                    b  =  float ( input ( "Второе слогаемое " )) 
                    print ( "Результат :"+  str (  a  +  b ))
               elif what ==  "-" :
                    a  =  float ( input ( "Уменьшаймое" ))
                    b  =  float ( input ( "Вычитаймое" ))  
                    print ( " Результат:"  +  str ( a  -  b ))
               elif what  ==  "*" :
                    a  =  float ( input ( "Первый множитель " ))
                    b  =  float ( input ( "Второй множитель " )) 
                    print ( "Результат :"  +  str ( a  * b ))
               elif what  ==  ":" :
                    a  =  float ( input ( "делимое " ))
                    b  =  float ( input ( "делитель" )) 
                    print ( "Результат :"  +  str ( a  / b ))
               elif what  ==  "**" :
                    a  =  float ( input ( "Первое число " ))
                    b  =  float ( input ( "Второе число " )) 
                    print ( "Результат :"  +  str ( a  **  b ))
          else:
               print ( "Неверная операция !!" )
     if what == 'геометрия':
          what=input( '3д или 2д фигуры?')
          if what == '2д':
               what  =  input ( 'какая фигура (прямоугольник, квадрад, окружность')
               if what ==  "прямоугольник" :
                    a  =  float ( input ( "Первая сторона" ))
                    b  =  float ( input ( "Вторая сторона" )) 
                    print ( "Результат периметр  :", a  +  b,'см плошадь:',a*b," см2")
               elif what ==  "квадрад" :
                    a  =  float ( input ( " сторона" ))
                    print (  "Результат периметр  :", a  +  a,'см плошадь:',a*a," см2")
                    
               elif what  ==  "окружность" :
                    a  =  float ( input ( "радиус" ))  
                    print ( "Результат периметр  :",  a*2*3.14,'см плошадь:',a**2*3.14," см2")
          if what == '3д':
               what  =  input ( 'какая фигура (куб, шар,цилиндр, параллелепипед)')
               if what ==  "шар" :
                    r=int(input ('радиус'))
                    print ( "Результат плошадь:'", 4* 3.14*r**2," см2 объём ",3/4*3.14*r**3 )  
               if what ==  " куб" :
                    a  =  float ( input ( "Сторона" ))
                    print ( "Результат периметр  :",  4*(a + a + a) ,'см плошадь:', 2*( a* a +   a*a +  a*a)," см2 объём ",a **3 )
               if what ==  " параллелепипед" :
                    a  =  float ( input ( "Первая сторона" ))
                    b  =  float ( input ( "Вторая сторона" ))
                    с = float ( input ( "Третья сторона" ))
                    print ( "Результат периметр  :",  4*(a + b + с) ,'см плошадь:', 2*( a* b +   b*с +  a*с)," см2 объём ",a * b * с )
          else:
               print ( "Неверная операция !! " )     
     if what == 'скорость':
          x= input( 'что ищем? время? скорость? растояние?')
          if x=='время':
               s=int(input( 'растояние?'))
               v=int(input( 'скорость?'))
               print(s/v)
          if x==' растояние':
               v=int(input( 'скорость?'))
               t=int(input( 'время?'))
               print(v*t)
          if x==' скорость':
               s=int(input( 'растояние?'))
               t=int(input( 'время?'))
               print(s/t)  
